---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PathOfTravelFailures.ResultAffectedByCrop
source: html/4ed32475-429e-4d84-0c8e-fb3769912270.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PathOfTravelFailures.ResultAffectedByCrop Property

A crop region is enabled in the view. The Path of Travel may not be the optimized route because it is calculating only inside the crop region.
 Consider uncropping the view and placing another Path of Travel to ensure you see the optimized route.

## Syntax (C#)
```csharp
public static FailureDefinitionId ResultAffectedByCrop { get; }
```